GopalSaraf/Practicals/PSDL/include/proc/pic16lf1567.inc
// Register: AD1TX0
#define AD1TX0 AD1TX0
AD1TX0                                   equ 0692h
// bitfield definitions
AD1TX0_TX10_POSN                         equ 0000h
AD1TX0_TX10_POSITION                     equ 0000h
AD1TX0_TX10_SIZE                         equ 0001h
AD1TX0_TX10_LENGTH                       equ 0001h
AD1TX0_TX10_MASK                         equ 0001h
AD1TX0_TX11_POSN                         equ 0001h
AD1TX0_TX11_POSITION                     equ 0001h
AD1TX0_TX11_SIZE                         equ 0001h
AD1TX0_TX11_LENGTH                       equ 0001h
AD1TX0_TX11_MASK                         equ 0002h
AD1TX0_TX12_POSN                         equ 0002h
AD1TX0_TX12_POSITION                     equ 0002h
AD1TX0_TX12_SIZE                         equ 0001h
AD1TX0_TX12_LENGTH                       equ 0001h
AD1TX0_TX12_MASK                         equ 0004h
AD1TX0_TX13_POSN                         equ 0003h
AD1TX0_TX13_POSITION                     equ 0003h
AD1TX0_TX13_SIZE                         equ 0001h
AD1TX0_TX13_LENGTH                       equ 0001h
AD1TX0_TX13_MASK                         equ 0008h
AD1TX0_TX14_POSN                         equ 0004h
AD1TX0_TX14_POSITION                     equ 0004h
AD1TX0_TX14_SIZE                         equ 0001h
AD1TX0_TX14_LENGTH                       equ 0001h
AD1TX0_TX14_MASK                         equ 0010h
AD1TX0_TX15_POSN                         equ 0005h
AD1TX0_TX15_POSITION                     equ 0005h
AD1TX0_TX15_SIZE                         equ 0001h
AD1TX0_TX15_LENGTH                       equ 0001h
AD1TX0_TX15_MASK                         equ 0020h
AD1TX0_TX16_POSN                         equ 0006h
AD1TX0_TX16_POSITION                     equ 0006h
AD1TX0_TX16_SIZE                         equ 0001h
AD1TX0_TX16_LENGTH                       equ 0001h
AD1TX0_TX16_MASK                         equ 0040h
AD1TX0_TX17_POSN                         equ 0007h
AD1TX0_TX17_POSITION                     equ 0007h
AD1TX0_TX17_SIZE                         equ 0001h
AD1TX0_TX17_LENGTH                       equ 0001h
AD1TX0_TX17_MASK                         equ 0080h

// Register: AD1TX1
#define AD1TX1 AD1TX1
AD1TX1                                   equ 0693h
// bitfield definitions
AD1TX1_TX18_POSN                         equ 0000h
AD1TX1_TX18_POSITION                     equ 0000h
AD1TX1_TX18_SIZE                         equ 0001h
AD1TX1_TX18_LENGTH                       equ 0001h
AD1TX1_TX18_MASK                         equ 0001h
AD1TX1_TX19_POSN                         equ 0001h
AD1TX1_TX19_POSITION                     equ 0001h
AD1TX1_TX19_SIZE                         equ 0001h
AD1TX1_TX19_LENGTH                       equ 0001h
AD1TX1_TX19_MASK                         equ 0002h
AD1TX1_TX30_POSN                         equ 0002h
AD1TX1_TX30_POSITION                     equ 0002h
AD1TX1_TX30_SIZE                         equ 0001h
AD1TX1_TX30_LENGTH                       equ 0001h
AD1TX1_TX30_MASK                         equ 0004h
AD1TX1_TX31_POSN                         equ 0003h
AD1TX1_TX31_POSITION                     equ 0003h
AD1TX1_TX31_SIZE                         equ 0001h
AD1TX1_TX31_LENGTH                       equ 0001h
AD1TX1_TX31_MASK                         equ 0008h
AD1TX1_TX32_POSN                         equ 0004h
AD1TX1_TX32_POSITION                     equ 0004h
AD1TX1_TX32_SIZE                         equ 0001h
AD1TX1_TX32_LENGTH                       equ 0001h
AD1TX1_TX32_MASK                         equ 0010h
AD1TX1_TX33_POSN                         equ 0005h
AD1TX1_TX33_POSITION                     equ 0005h
AD1TX1_TX33_SIZE                         equ 0001h
AD1TX1_TX33_LENGTH                       equ 0001h
AD1TX1_TX33_MASK                         equ 0020h
AD1TX1_TX34_POSN                         equ 0006h
AD1TX1_TX34_POSITION                     equ 0006h
AD1TX1_TX34_SIZE                         equ 0001h
AD1TX1_TX34_LENGTH                       equ 0001h
AD1TX1_TX34_MASK                         equ 0040h
AD1TX1_TX35_POSN                         equ 0007h
AD1TX1_TX35_POSITION                     equ 0007h
AD1TX1_TX35_SIZE                         equ 0001h
AD1TX1_TX35_LENGTH                       equ 0001h
AD1TX1_TX35_MASK                         equ 0080h

// Register: AD2TX0
#define AD2TX0 AD2TX0
AD2TX0                                   equ 0694h
// bitfield definitions
AD2TX0_TX20_POSN                         equ 0000h
AD2TX0_TX20_POSITION                     equ 0000h
AD2TX0_TX20_SIZE                         equ 0001h
AD2TX0_TX20_LENGTH                       equ 0001h
AD2TX0_TX20_MASK                         equ 0001h
AD2TX0_TX21_POSN                         equ 0001h
AD2TX0_TX21_POSITION                     equ 0001h
AD2TX0_TX21_SIZE                         equ 0001h
AD2TX0_TX21_LENGTH                       equ 0001h
AD2TX0_TX21_MASK                         equ 0002h
AD2TX0_TX22_POSN                         equ 0002h
AD2TX0_TX22_POSITION                     equ 0002h
AD2TX0_TX22_SIZE                         equ 0001h
AD2TX0_TX22_LENGTH                       equ 0001h
AD2TX0_TX22_MASK                         equ 0004h
AD2TX0_TX23_POSN                         equ 0003h
AD2TX0_TX23_POSITION                     equ 0003h
AD2TX0_TX23_SIZE                         equ 0001h
AD2TX0_TX23_LENGTH                       equ 0001h
AD2TX0_TX23_MASK                         equ 0008h
AD2TX0_TX24_POSN                         equ 0004h
AD2TX0_TX24_POSITION                     equ 0004h
AD2TX0_TX24_SIZE                         equ 0001h
AD2TX0_TX24_LENGTH                       equ 0001h
AD2TX0_TX24_MASK                         equ 0010h
AD2TX0_TX25_POSN                         equ 0005h
AD2TX0_TX25_POSITION                     equ 0005h
AD2TX0_TX25_SIZE                         equ 0001h
AD2TX0_TX25_LENGTH                       equ 0001h
AD2TX0_TX25_MASK                         equ 0020h
AD2TX0_TX26_POSN                         equ 0006h
AD2TX0_TX26_POSITION                     equ 0006h
AD2TX0_TX26_SIZE                         equ 0001h
AD2TX0_TX26_LENGTH                       equ 0001h
AD2TX0_TX26_MASK                         equ 0040h
AD2TX0_TX27_POSN                         equ 0007h
AD2TX0_TX27_POSITION                     equ 0007h
AD2TX0_TX27_SIZE                         equ 0001h
AD2TX0_TX27_LENGTH                       equ 0001h
AD2TX0_TX27_MASK                         equ 0080h

