GopalSaraf/Practicals/PSDL/include/proc/pic16lf1567.inc
// Register: AD2TX1
#define AD2TX1 AD2TX1
AD2TX1                                   equ 0695h
// bitfield definitions
AD2TX1_TX28_POSN                         equ 0000h
AD2TX1_TX28_POSITION                     equ 0000h
AD2TX1_TX28_SIZE                         equ 0001h
AD2TX1_TX28_LENGTH                       equ 0001h
AD2TX1_TX28_MASK                         equ 0001h
AD2TX1_TX29_POSN                         equ 0001h
AD2TX1_TX29_POSITION                     equ 0001h
AD2TX1_TX29_SIZE                         equ 0001h
AD2TX1_TX29_LENGTH                       equ 0001h
AD2TX1_TX29_MASK                         equ 0002h
AD2TX1_TX40_POSN                         equ 0002h
AD2TX1_TX40_POSITION                     equ 0002h
AD2TX1_TX40_SIZE                         equ 0001h
AD2TX1_TX40_LENGTH                       equ 0001h
AD2TX1_TX40_MASK                         equ 0004h
AD2TX1_TX41_POSN                         equ 0003h
AD2TX1_TX41_POSITION                     equ 0003h
AD2TX1_TX41_SIZE                         equ 0001h
AD2TX1_TX41_LENGTH                       equ 0001h
AD2TX1_TX41_MASK                         equ 0008h
AD2TX1_TX42_POSN                         equ 0004h
AD2TX1_TX42_POSITION                     equ 0004h
AD2TX1_TX42_SIZE                         equ 0001h
AD2TX1_TX42_LENGTH                       equ 0001h
AD2TX1_TX42_MASK                         equ 0010h
AD2TX1_TX43_POSN                         equ 0005h
AD2TX1_TX43_POSITION                     equ 0005h
AD2TX1_TX43_SIZE                         equ 0001h
AD2TX1_TX43_LENGTH                       equ 0001h
AD2TX1_TX43_MASK                         equ 0020h
AD2TX1_TX44_POSN                         equ 0006h
AD2TX1_TX44_POSITION                     equ 0006h
AD2TX1_TX44_SIZE                         equ 0001h
AD2TX1_TX44_LENGTH                       equ 0001h
AD2TX1_TX44_MASK                         equ 0040h
AD2TX1_TX45_POSN                         equ 0007h
AD2TX1_TX45_POSITION                     equ 0007h
AD2TX1_TX45_SIZE                         equ 0001h
AD2TX1_TX45_LENGTH                       equ 0001h
AD2TX1_TX45_MASK                         equ 0080h

// Register: AD1CON0
#define AD1CON0 AD1CON0
AD1CON0                                  equ 0711h
// bitfield definitions
AD1CON0_ADON_POSN                        equ 0000h
AD1CON0_ADON_POSITION                    equ 0000h
AD1CON0_ADON_SIZE                        equ 0001h
AD1CON0_ADON_LENGTH                      equ 0001h
AD1CON0_ADON_MASK                        equ 0001h
AD1CON0_GO_POSN                          equ 0001h
AD1CON0_GO_POSITION                      equ 0001h
AD1CON0_GO_SIZE                          equ 0001h
AD1CON0_GO_LENGTH                        equ 0001h
AD1CON0_GO_MASK                          equ 0002h
AD1CON0_CHS_POSN                         equ 0002h
AD1CON0_CHS_POSITION                     equ 0002h
AD1CON0_CHS_SIZE                         equ 0006h
AD1CON0_CHS_LENGTH                       equ 0006h
AD1CON0_CHS_MASK                         equ 00FCh
AD1CON0_AD1ON_POSN                       equ 0000h
AD1CON0_AD1ON_POSITION                   equ 0000h
AD1CON0_AD1ON_SIZE                       equ 0001h
AD1CON0_AD1ON_LENGTH                     equ 0001h
AD1CON0_AD1ON_MASK                       equ 0001h
AD1CON0_GO_nDONE_POSN                    equ 0001h
AD1CON0_GO_nDONE_POSITION                equ 0001h
AD1CON0_GO_nDONE_SIZE                    equ 0001h
AD1CON0_GO_nDONE_LENGTH                  equ 0001h
AD1CON0_GO_nDONE_MASK                    equ 0002h
AD1CON0_CHS0_POSN                        equ 0002h
AD1CON0_CHS0_POSITION                    equ 0002h
AD1CON0_CHS0_SIZE                        equ 0001h
AD1CON0_CHS0_LENGTH                      equ 0001h
AD1CON0_CHS0_MASK                        equ 0004h
AD1CON0_CHS1_POSN                        equ 0003h
AD1CON0_CHS1_POSITION                    equ 0003h
AD1CON0_CHS1_SIZE                        equ 0001h
AD1CON0_CHS1_LENGTH                      equ 0001h
AD1CON0_CHS1_MASK                        equ 0008h
AD1CON0_CHS2_POSN                        equ 0004h
AD1CON0_CHS2_POSITION                    equ 0004h
AD1CON0_CHS2_SIZE                        equ 0001h
AD1CON0_CHS2_LENGTH                      equ 0001h
AD1CON0_CHS2_MASK                        equ 0010h
AD1CON0_CHS3_POSN                        equ 0005h
AD1CON0_CHS3_POSITION                    equ 0005h
AD1CON0_CHS3_SIZE                        equ 0001h
AD1CON0_CHS3_LENGTH                      equ 0001h
AD1CON0_CHS3_MASK                        equ 0020h
AD1CON0_CHS4_POSN                        equ 0006h
AD1CON0_CHS4_POSITION                    equ 0006h
AD1CON0_CHS4_SIZE                        equ 0001h
AD1CON0_CHS4_LENGTH                      equ 0001h
AD1CON0_CHS4_MASK                        equ 0040h
AD1CON0_CHS5_POSN                        equ 0007h
AD1CON0_CHS5_POSITION                    equ 0007h
AD1CON0_CHS5_SIZE                        equ 0001h
AD1CON0_CHS5_LENGTH                      equ 0001h
AD1CON0_CHS5_MASK                        equ 0080h
AD1CON0_GO_nDONE1_POSN                   equ 0001h
AD1CON0_GO_nDONE1_POSITION               equ 0001h
AD1CON0_GO_nDONE1_SIZE                   equ 0001h
AD1CON0_GO_nDONE1_LENGTH                 equ 0001h
AD1CON0_GO_nDONE1_MASK                   equ 0002h

// Register: ADCOMCON
#define ADCOMCON ADCOMCON
ADCOMCON                                 equ 0712h
// bitfield definitions
ADCOMCON_ADPREF_POSN                     equ 0000h
ADCOMCON_ADPREF_POSITION                 equ 0000h
ADCOMCON_ADPREF_SIZE                     equ 0002h
ADCOMCON_ADPREF_LENGTH                   equ 0002h
ADCOMCON_ADPREF_MASK                     equ 0003h
ADCOMCON_GO_nDONE_ALL_POSN               equ 0002h
ADCOMCON_GO_nDONE_ALL_POSITION           equ 0002h
ADCOMCON_GO_nDONE_ALL_SIZE               equ 0001h
ADCOMCON_GO_nDONE_ALL_LENGTH             equ 0001h
ADCOMCON_GO_nDONE_ALL_MASK               equ 0004h
ADCOMCON_ADNREF_POSN                     equ 0003h
ADCOMCON_ADNREF_POSITION                 equ 0003h
ADCOMCON_ADNREF_SIZE                     equ 0001h
ADCOMCON_ADNREF_LENGTH                   equ 0001h
ADCOMCON_ADNREF_MASK                     equ 0008h
ADCOMCON_ADCS_POSN                       equ 0004h
ADCOMCON_ADCS_POSITION                   equ 0004h
ADCOMCON_ADCS_SIZE                       equ 0003h
ADCOMCON_ADCS_LENGTH                     equ 0003h
ADCOMCON_ADCS_MASK                       equ 0070h
ADCOMCON_ADFM_POSN                       equ 0007h
ADCOMCON_ADFM_POSITION                   equ 0007h
ADCOMCON_ADFM_SIZE                       equ 0001h
ADCOMCON_ADFM_LENGTH                     equ 0001h
ADCOMCON_ADFM_MASK                       equ 0080h
ADCOMCON_ADPREF0_POSN                    equ 0000h
ADCOMCON_ADPREF0_POSITION                equ 0000h
ADCOMCON_ADPREF0_SIZE                    equ 0001h
ADCOMCON_ADPREF0_LENGTH                  equ 0001h
ADCOMCON_ADPREF0_MASK                    equ 0001h
ADCOMCON_ADPREF1_POSN                    equ 0001h
ADCOMCON_ADPREF1_POSITION                equ 0001h
ADCOMCON_ADPREF1_SIZE                    equ 0001h
ADCOMCON_ADPREF1_LENGTH                  equ 0001h
ADCOMCON_ADPREF1_MASK                    equ 0002h
ADCOMCON_GO_ALL_POSN                     equ 0002h
ADCOMCON_GO_ALL_POSITION                 equ 0002h
ADCOMCON_GO_ALL_SIZE                     equ 0001h
ADCOMCON_GO_ALL_LENGTH                   equ 0001h
ADCOMCON_GO_ALL_MASK                     equ 0004h
ADCOMCON_ADCS0_POSN                      equ 0004h
ADCOMCON_ADCS0_POSITION                  equ 0004h
ADCOMCON_ADCS0_SIZE                      equ 0001h
ADCOMCON_ADCS0_LENGTH                    equ 0001h
ADCOMCON_ADCS0_MASK                      equ 0010h
ADCOMCON_ADCS1_POSN                      equ 0005h
ADCOMCON_ADCS1_POSITION                  equ 0005h
ADCOMCON_ADCS1_SIZE                      equ 0001h
ADCOMCON_ADCS1_LENGTH                    equ 0001h
ADCOMCON_ADCS1_MASK                      equ 0020h
ADCOMCON_ADCS2_POSN                      equ 0006h
ADCOMCON_ADCS2_POSITION                  equ 0006h
ADCOMCON_ADCS2_SIZE                      equ 0001h
ADCOMCON_ADCS2_LENGTH                    equ 0001h
ADCOMCON_ADCS2_MASK                      equ 0040h

// Register: AD1CON2
#define AD1CON2 AD1CON2
AD1CON2                                  equ 0713h
// bitfield definitions
AD1CON2_TRIGSEL_POSN                     equ 0004h
AD1CON2_TRIGSEL_POSITION                 equ 0004h
AD1CON2_TRIGSEL_SIZE                     equ 0003h
AD1CON2_TRIGSEL_LENGTH                   equ 0003h
AD1CON2_TRIGSEL_MASK                     equ 0070h
AD1CON2_TRIGSEL0_POSN                    equ 0004h
AD1CON2_TRIGSEL0_POSITION                equ 0004h
AD1CON2_TRIGSEL0_SIZE                    equ 0001h
AD1CON2_TRIGSEL0_LENGTH                  equ 0001h
AD1CON2_TRIGSEL0_MASK                    equ 0010h
AD1CON2_TRIGSEL1_POSN                    equ 0005h
AD1CON2_TRIGSEL1_POSITION                equ 0005h
AD1CON2_TRIGSEL1_SIZE                    equ 0001h
AD1CON2_TRIGSEL1_LENGTH                  equ 0001h
AD1CON2_TRIGSEL1_MASK                    equ 0020h
AD1CON2_TRIGSEL2_POSN                    equ 0006h
AD1CON2_TRIGSEL2_POSITION                equ 0006h
AD1CON2_TRIGSEL2_SIZE                    equ 0001h
AD1CON2_TRIGSEL2_LENGTH                  equ 0001h
AD1CON2_TRIGSEL2_MASK                    equ 0040h

