GopalSaraf/Practicals/PSDL/include/proc/pic16lf1567.inc
// Register: AD1CON3
#define AD1CON3 AD1CON3
AD1CON3                                  equ 0714h
// bitfield definitions
AD1CON3_AD1DSEN_POSN                     equ 0000h
AD1CON3_AD1DSEN_POSITION                 equ 0000h
AD1CON3_AD1DSEN_SIZE                     equ 0001h
AD1CON3_AD1DSEN_LENGTH                   equ 0001h
AD1CON3_AD1DSEN_MASK                     equ 0001h
AD1CON3_AD1IPEN_POSN                     equ 0001h
AD1CON3_AD1IPEN_POSITION                 equ 0001h
AD1CON3_AD1IPEN_SIZE                     equ 0001h
AD1CON3_AD1IPEN_LENGTH                   equ 0001h
AD1CON3_AD1IPEN_MASK                     equ 0002h
AD1CON3_AD1IPPOL_POSN                    equ 0006h
AD1CON3_AD1IPPOL_POSITION                equ 0006h
AD1CON3_AD1IPPOL_SIZE                    equ 0001h
AD1CON3_AD1IPPOL_LENGTH                  equ 0001h
AD1CON3_AD1IPPOL_MASK                    equ 0040h
AD1CON3_AD1EPPOL_POSN                    equ 0007h
AD1CON3_AD1EPPOL_POSITION                equ 0007h
AD1CON3_AD1EPPOL_SIZE                    equ 0001h
AD1CON3_AD1EPPOL_LENGTH                  equ 0001h
AD1CON3_AD1EPPOL_MASK                    equ 0080h
AD1CON3_ADDSEN_POSN                      equ 0000h
AD1CON3_ADDSEN_POSITION                  equ 0000h
AD1CON3_ADDSEN_SIZE                      equ 0001h
AD1CON3_ADDSEN_LENGTH                    equ 0001h
AD1CON3_ADDSEN_MASK                      equ 0001h
AD1CON3_ADIPEN_POSN                      equ 0001h
AD1CON3_ADIPEN_POSITION                  equ 0001h
AD1CON3_ADIPEN_SIZE                      equ 0001h
AD1CON3_ADIPEN_LENGTH                    equ 0001h
AD1CON3_ADIPEN_MASK                      equ 0002h
AD1CON3_ADIPPOL_POSN                     equ 0006h
AD1CON3_ADIPPOL_POSITION                 equ 0006h
AD1CON3_ADIPPOL_SIZE                     equ 0001h
AD1CON3_ADIPPOL_LENGTH                   equ 0001h
AD1CON3_ADIPPOL_MASK                     equ 0040h
AD1CON3_ADEPPOL_POSN                     equ 0007h
AD1CON3_ADEPPOL_POSITION                 equ 0007h
AD1CON3_ADEPPOL_SIZE                     equ 0001h
AD1CON3_ADEPPOL_LENGTH                   equ 0001h
AD1CON3_ADEPPOL_MASK                     equ 0080h

// Register: ADSTAT
#define ADSTAT ADSTAT
ADSTAT                                   equ 0715h
// bitfield definitions
ADSTAT_AD1STG_POSN                       equ 0000h
ADSTAT_AD1STG_POSITION                   equ 0000h
ADSTAT_AD1STG_SIZE                       equ 0002h
ADSTAT_AD1STG_LENGTH                     equ 0002h
ADSTAT_AD1STG_MASK                       equ 0003h
ADSTAT_AD1CONV_POSN                      equ 0002h
ADSTAT_AD1CONV_POSITION                  equ 0002h
ADSTAT_AD1CONV_SIZE                      equ 0001h
ADSTAT_AD1CONV_LENGTH                    equ 0001h
ADSTAT_AD1CONV_MASK                      equ 0004h
ADSTAT_AD2STG_POSN                       equ 0004h
ADSTAT_AD2STG_POSITION                   equ 0004h
ADSTAT_AD2STG_SIZE                       equ 0002h
ADSTAT_AD2STG_LENGTH                     equ 0002h
ADSTAT_AD2STG_MASK                       equ 0030h
ADSTAT_AD2CONV_POSN                      equ 0006h
ADSTAT_AD2CONV_POSITION                  equ 0006h
ADSTAT_AD2CONV_SIZE                      equ 0001h
ADSTAT_AD2CONV_LENGTH                    equ 0001h
ADSTAT_AD2CONV_MASK                      equ 0040h
ADSTAT_ADSTG_POSN                        equ 0000h
ADSTAT_ADSTG_POSITION                    equ 0000h
ADSTAT_ADSTG_SIZE                        equ 0002h
ADSTAT_ADSTG_LENGTH                      equ 0002h
ADSTAT_ADSTG_MASK                        equ 0003h
ADSTAT_ADCONV_POSN                       equ 0002h
ADSTAT_ADCONV_POSITION                   equ 0002h
ADSTAT_ADCONV_SIZE                       equ 0001h
ADSTAT_ADCONV_LENGTH                     equ 0001h
ADSTAT_ADCONV_MASK                       equ 0004h
ADSTAT_AD1STG0_POSN                      equ 0000h
ADSTAT_AD1STG0_POSITION                  equ 0000h
ADSTAT_AD1STG0_SIZE                      equ 0001h
ADSTAT_AD1STG0_LENGTH                    equ 0001h
ADSTAT_AD1STG0_MASK                      equ 0001h
ADSTAT_AD1STG1_POSN                      equ 0001h
ADSTAT_AD1STG1_POSITION                  equ 0001h
ADSTAT_AD1STG1_SIZE                      equ 0001h
ADSTAT_AD1STG1_LENGTH                    equ 0001h
ADSTAT_AD1STG1_MASK                      equ 0002h
ADSTAT_AD2STG0_POSN                      equ 0004h
ADSTAT_AD2STG0_POSITION                  equ 0004h
ADSTAT_AD2STG0_SIZE                      equ 0001h
ADSTAT_AD2STG0_LENGTH                    equ 0001h
ADSTAT_AD2STG0_MASK                      equ 0010h
ADSTAT_AD2STG1_POSN                      equ 0005h
ADSTAT_AD2STG1_POSITION                  equ 0005h
ADSTAT_AD2STG1_SIZE                      equ 0001h
ADSTAT_AD2STG1_LENGTH                    equ 0001h
ADSTAT_AD2STG1_MASK                      equ 0020h

// Register: AD1PRECON
#define AD1PRECON AD1PRECON
AD1PRECON                                equ 0716h
// bitfield definitions
AD1PRECON_ADPRE_POSN                     equ 0000h
AD1PRECON_ADPRE_POSITION                 equ 0000h
AD1PRECON_ADPRE_SIZE                     equ 0007h
AD1PRECON_ADPRE_LENGTH                   equ 0007h
AD1PRECON_ADPRE_MASK                     equ 007Fh
AD1PRECON_ADPRE0_POSN                    equ 0000h
AD1PRECON_ADPRE0_POSITION                equ 0000h
AD1PRECON_ADPRE0_SIZE                    equ 0001h
AD1PRECON_ADPRE0_LENGTH                  equ 0001h
AD1PRECON_ADPRE0_MASK                    equ 0001h
AD1PRECON_ADPRE1_POSN                    equ 0001h
AD1PRECON_ADPRE1_POSITION                equ 0001h
AD1PRECON_ADPRE1_SIZE                    equ 0001h
AD1PRECON_ADPRE1_LENGTH                  equ 0001h
AD1PRECON_ADPRE1_MASK                    equ 0002h
AD1PRECON_ADPRE2_POSN                    equ 0002h
AD1PRECON_ADPRE2_POSITION                equ 0002h
AD1PRECON_ADPRE2_SIZE                    equ 0001h
AD1PRECON_ADPRE2_LENGTH                  equ 0001h
AD1PRECON_ADPRE2_MASK                    equ 0004h
AD1PRECON_ADPRE3_POSN                    equ 0003h
AD1PRECON_ADPRE3_POSITION                equ 0003h
AD1PRECON_ADPRE3_SIZE                    equ 0001h
AD1PRECON_ADPRE3_LENGTH                  equ 0001h
AD1PRECON_ADPRE3_MASK                    equ 0008h
AD1PRECON_ADPRE4_POSN                    equ 0004h
AD1PRECON_ADPRE4_POSITION                equ 0004h
AD1PRECON_ADPRE4_SIZE                    equ 0001h
AD1PRECON_ADPRE4_LENGTH                  equ 0001h
AD1PRECON_ADPRE4_MASK                    equ 0010h
AD1PRECON_ADPRE5_POSN                    equ 0005h
AD1PRECON_ADPRE5_POSITION                equ 0005h
AD1PRECON_ADPRE5_SIZE                    equ 0001h
AD1PRECON_ADPRE5_LENGTH                  equ 0001h
AD1PRECON_ADPRE5_MASK                    equ 0020h
AD1PRECON_ADPRE6_POSN                    equ 0006h
AD1PRECON_ADPRE6_POSITION                equ 0006h
AD1PRECON_ADPRE6_SIZE                    equ 0001h
AD1PRECON_ADPRE6_LENGTH                  equ 0001h
AD1PRECON_ADPRE6_MASK                    equ 0040h

// Register: AD1ACQCON
#define AD1ACQCON AD1ACQCON
AD1ACQCON                                equ 0717h
// bitfield definitions
AD1ACQCON_ADACQ_POSN                     equ 0000h
AD1ACQCON_ADACQ_POSITION                 equ 0000h
AD1ACQCON_ADACQ_SIZE                     equ 0007h
AD1ACQCON_ADACQ_LENGTH                   equ 0007h
AD1ACQCON_ADACQ_MASK                     equ 007Fh
AD1ACQCON_ADACQ0_POSN                    equ 0000h
AD1ACQCON_ADACQ0_POSITION                equ 0000h
AD1ACQCON_ADACQ0_SIZE                    equ 0001h
AD1ACQCON_ADACQ0_LENGTH                  equ 0001h
AD1ACQCON_ADACQ0_MASK                    equ 0001h
AD1ACQCON_ADACQ1_POSN                    equ 0001h
AD1ACQCON_ADACQ1_POSITION                equ 0001h
AD1ACQCON_ADACQ1_SIZE                    equ 0001h
AD1ACQCON_ADACQ1_LENGTH                  equ 0001h
AD1ACQCON_ADACQ1_MASK                    equ 0002h
AD1ACQCON_ADACQ2_POSN                    equ 0002h
AD1ACQCON_ADACQ2_POSITION                equ 0002h
AD1ACQCON_ADACQ2_SIZE                    equ 0001h
AD1ACQCON_ADACQ2_LENGTH                  equ 0001h
AD1ACQCON_ADACQ2_MASK                    equ 0004h
AD1ACQCON_ADACQ3_POSN                    equ 0003h
AD1ACQCON_ADACQ3_POSITION                equ 0003h
AD1ACQCON_ADACQ3_SIZE                    equ 0001h
AD1ACQCON_ADACQ3_LENGTH                  equ 0001h
AD1ACQCON_ADACQ3_MASK                    equ 0008h
AD1ACQCON_ADACQ4_POSN                    equ 0004h
AD1ACQCON_ADACQ4_POSITION                equ 0004h
AD1ACQCON_ADACQ4_SIZE                    equ 0001h
AD1ACQCON_ADACQ4_LENGTH                  equ 0001h
AD1ACQCON_ADACQ4_MASK                    equ 0010h
AD1ACQCON_ADACQ5_POSN                    equ 0005h
AD1ACQCON_ADACQ5_POSITION                equ 0005h
AD1ACQCON_ADACQ5_SIZE                    equ 0001h
AD1ACQCON_ADACQ5_LENGTH                  equ 0001h
AD1ACQCON_ADACQ5_MASK                    equ 0020h
AD1ACQCON_ADACQ6_POSN                    equ 0006h
AD1ACQCON_ADACQ6_POSITION                equ 0006h
AD1ACQCON_ADACQ6_SIZE                    equ 0001h
AD1ACQCON_ADACQ6_LENGTH                  equ 0001h
AD1ACQCON_ADACQ6_MASK                    equ 0040h

// Register: AD1GRD
#define AD1GRD AD1GRD
AD1GRD                                   equ 0718h
// bitfield definitions
AD1GRD_TX1POL_POSN                       equ 0000h
AD1GRD_TX1POL_POSITION                   equ 0000h
AD1GRD_TX1POL_SIZE                       equ 0001h
AD1GRD_TX1POL_LENGTH                     equ 0001h
AD1GRD_TX1POL_MASK                       equ 0001h
AD1GRD_GRD1POL_POSN                      equ 0005h
AD1GRD_GRD1POL_POSITION                  equ 0005h
AD1GRD_GRD1POL_SIZE                      equ 0001h
AD1GRD_GRD1POL_LENGTH                    equ 0001h
AD1GRD_GRD1POL_MASK                      equ 0020h
AD1GRD_GRD1AOE_POSN                      equ 0006h
AD1GRD_GRD1AOE_POSITION                  equ 0006h
AD1GRD_GRD1AOE_SIZE                      equ 0001h
AD1GRD_GRD1AOE_LENGTH                    equ 0001h
AD1GRD_GRD1AOE_MASK                      equ 0040h
AD1GRD_GRD1BOE_POSN                      equ 0007h
AD1GRD_GRD1BOE_POSITION                  equ 0007h
AD1GRD_GRD1BOE_SIZE                      equ 0001h
AD1GRD_GRD1BOE_LENGTH                    equ 0001h
AD1GRD_GRD1BOE_MASK                      equ 0080h
AD1GRD_TXPOL_POSN                        equ 0000h
AD1GRD_TXPOL_POSITION                    equ 0000h
AD1GRD_TXPOL_SIZE                        equ 0001h
AD1GRD_TXPOL_LENGTH                      equ 0001h
AD1GRD_TXPOL_MASK                        equ 0001h
AD1GRD_GRDPOL_POSN                       equ 0005h
AD1GRD_GRDPOL_POSITION                   equ 0005h
AD1GRD_GRDPOL_SIZE                       equ 0001h
AD1GRD_GRDPOL_LENGTH                     equ 0001h
AD1GRD_GRDPOL_MASK                       equ 0020h
AD1GRD_GRDAOE_POSN                       equ 0006h
AD1GRD_GRDAOE_POSITION                   equ 0006h
AD1GRD_GRDAOE_SIZE                       equ 0001h
AD1GRD_GRDAOE_LENGTH                     equ 0001h
AD1GRD_GRDAOE_MASK                       equ 0040h
AD1GRD_GRDBOE_POSN                       equ 0007h
AD1GRD_GRDBOE_POSITION                   equ 0007h
AD1GRD_GRDBOE_SIZE                       equ 0001h
AD1GRD_GRDBOE_LENGTH                     equ 0001h
AD1GRD_GRDBOE_MASK                       equ 0080h

// Register: AD1CAPCON
#define AD1CAPCON AD1CAPCON
AD1CAPCON                                equ 0719h
// bitfield definitions
AD1CAPCON_ADDCAP_POSN                    equ 0000h
AD1CAPCON_ADDCAP_POSITION                equ 0000h
AD1CAPCON_ADDCAP_SIZE                    equ 0004h
AD1CAPCON_ADDCAP_LENGTH                  equ 0004h
AD1CAPCON_ADDCAP_MASK                    equ 000Fh
AD1CAPCON_ADCAP_POSN                     equ 0000h
AD1CAPCON_ADCAP_POSITION                 equ 0000h
AD1CAPCON_ADCAP_SIZE                     equ 0004h
AD1CAPCON_ADCAP_LENGTH                   equ 0004h
AD1CAPCON_ADCAP_MASK                     equ 000Fh
AD1CAPCON_ADDCAP0_POSN                   equ 0000h
AD1CAPCON_ADDCAP0_POSITION               equ 0000h
AD1CAPCON_ADDCAP0_SIZE                   equ 0001h
AD1CAPCON_ADDCAP0_LENGTH                 equ 0001h
AD1CAPCON_ADDCAP0_MASK                   equ 0001h
AD1CAPCON_ADDCAP1_POSN                   equ 0001h
AD1CAPCON_ADDCAP1_POSITION               equ 0001h
AD1CAPCON_ADDCAP1_SIZE                   equ 0001h
AD1CAPCON_ADDCAP1_LENGTH                 equ 0001h
AD1CAPCON_ADDCAP1_MASK                   equ 0002h
AD1CAPCON_ADDCAP2_POSN                   equ 0002h
AD1CAPCON_ADDCAP2_POSITION               equ 0002h
AD1CAPCON_ADDCAP2_SIZE                   equ 0001h
AD1CAPCON_ADDCAP2_LENGTH                 equ 0001h
AD1CAPCON_ADDCAP2_MASK                   equ 0004h
AD1CAPCON_ADDCAP3_POSN                   equ 0003h
AD1CAPCON_ADDCAP3_POSITION               equ 0003h
AD1CAPCON_ADDCAP3_SIZE                   equ 0001h
AD1CAPCON_ADDCAP3_LENGTH                 equ 0001h
AD1CAPCON_ADDCAP3_MASK                   equ 0008h
AD1CAPCON_ADD1CAP_POSN                   equ 0000h
AD1CAPCON_ADD1CAP_POSITION               equ 0000h
AD1CAPCON_ADD1CAP_SIZE                   equ 0004h
AD1CAPCON_ADD1CAP_LENGTH                 equ 0004h
AD1CAPCON_ADD1CAP_MASK                   equ 000Fh

// Register: AAD1RES0L
#define AAD1RES0L AAD1RES0L
AAD1RES0L                                equ 071Ah
// bitfield definitions
AAD1RES0L_ADRESL_POSN                    equ 0000h
AAD1RES0L_ADRESL_POSITION                equ 0000h
AAD1RES0L_ADRESL_SIZE                    equ 0008h
AAD1RES0L_ADRESL_LENGTH                  equ 0008h
AAD1RES0L_ADRESL_MASK                    equ 00FFh

// Register: AAD1RES0H
#define AAD1RES0H AAD1RES0H
AAD1RES0H                                equ 071Bh
// bitfield definitions
AAD1RES0H_ADRESH_POSN                    equ 0000h
AAD1RES0H_ADRESH_POSITION                equ 0000h
AAD1RES0H_ADRESH_SIZE                    equ 0008h
AAD1RES0H_ADRESH_LENGTH                  equ 0008h
AAD1RES0H_ADRESH_MASK                    equ 00FFh

// Register: AAD1RES1L
#define AAD1RES1L AAD1RES1L
AAD1RES1L                                equ 071Ch
// bitfield definitions
AAD1RES1L_ADRESL_POSN                    equ 0000h
AAD1RES1L_ADRESL_POSITION                equ 0000h
AAD1RES1L_ADRESL_SIZE                    equ 0008h
AAD1RES1L_ADRESL_LENGTH                  equ 0008h
AAD1RES1L_ADRESL_MASK                    equ 00FFh

// Register: AAD1RES1H
#define AAD1RES1H AAD1RES1H
AAD1RES1H                                equ 071Dh
// bitfield definitions
AAD1RES1H_ADRESH_POSN                    equ 0000h
AAD1RES1H_ADRESH_POSITION                equ 0000h
AAD1RES1H_ADRESH_SIZE                    equ 0008h
AAD1RES1H_ADRESH_LENGTH                  equ 0008h
AAD1RES1H_ADRESH_MASK                    equ 00FFh

