GopalSaraf/Practicals/PSDL/include/proc/pic16lf1567.inc
// Register: AD1CH0
#define AD1CH0 AD1CH0
AD1CH0                                   equ 071Eh
// bitfield definitions
AD1CH0_CH10_POSN                         equ 0000h
AD1CH0_CH10_POSITION                     equ 0000h
AD1CH0_CH10_SIZE                         equ 0001h
AD1CH0_CH10_LENGTH                       equ 0001h
AD1CH0_CH10_MASK                         equ 0001h
AD1CH0_CH11_POSN                         equ 0001h
AD1CH0_CH11_POSITION                     equ 0001h
AD1CH0_CH11_SIZE                         equ 0001h
AD1CH0_CH11_LENGTH                       equ 0001h
AD1CH0_CH11_MASK                         equ 0002h
AD1CH0_CH12_POSN                         equ 0002h
AD1CH0_CH12_POSITION                     equ 0002h
AD1CH0_CH12_SIZE                         equ 0001h
AD1CH0_CH12_LENGTH                       equ 0001h
AD1CH0_CH12_MASK                         equ 0004h
AD1CH0_CH13_POSN                         equ 0003h
AD1CH0_CH13_POSITION                     equ 0003h
AD1CH0_CH13_SIZE                         equ 0001h
AD1CH0_CH13_LENGTH                       equ 0001h
AD1CH0_CH13_MASK                         equ 0008h
AD1CH0_CH14_POSN                         equ 0004h
AD1CH0_CH14_POSITION                     equ 0004h
AD1CH0_CH14_SIZE                         equ 0001h
AD1CH0_CH14_LENGTH                       equ 0001h
AD1CH0_CH14_MASK                         equ 0010h
AD1CH0_CH15_POSN                         equ 0005h
AD1CH0_CH15_POSITION                     equ 0005h
AD1CH0_CH15_SIZE                         equ 0001h
AD1CH0_CH15_LENGTH                       equ 0001h
AD1CH0_CH15_MASK                         equ 0020h
AD1CH0_CH16_POSN                         equ 0006h
AD1CH0_CH16_POSITION                     equ 0006h
AD1CH0_CH16_SIZE                         equ 0001h
AD1CH0_CH16_LENGTH                       equ 0001h
AD1CH0_CH16_MASK                         equ 0040h
AD1CH0_CHS17_POSN                        equ 0007h
AD1CH0_CHS17_POSITION                    equ 0007h
AD1CH0_CHS17_SIZE                        equ 0001h
AD1CH0_CHS17_LENGTH                      equ 0001h
AD1CH0_CHS17_MASK                        equ 0080h
AD1CH0_CH17_POSN                         equ 0007h
AD1CH0_CH17_POSITION                     equ 0007h
AD1CH0_CH17_SIZE                         equ 0001h
AD1CH0_CH17_LENGTH                       equ 0001h
AD1CH0_CH17_MASK                         equ 0080h

// Register: AD1CH1
#define AD1CH1 AD1CH1
AD1CH1                                   equ 071Fh
// bitfield definitions
AD1CH1_CH18_POSN                         equ 0000h
AD1CH1_CH18_POSITION                     equ 0000h
AD1CH1_CH18_SIZE                         equ 0001h
AD1CH1_CH18_LENGTH                       equ 0001h
AD1CH1_CH18_MASK                         equ 0001h
AD1CH1_CH19_POSN                         equ 0001h
AD1CH1_CH19_POSITION                     equ 0001h
AD1CH1_CH19_SIZE                         equ 0001h
AD1CH1_CH19_LENGTH                       equ 0001h
AD1CH1_CH19_MASK                         equ 0002h
AD1CH1_CH30_POSN                         equ 0002h
AD1CH1_CH30_POSITION                     equ 0002h
AD1CH1_CH30_SIZE                         equ 0001h
AD1CH1_CH30_LENGTH                       equ 0001h
AD1CH1_CH30_MASK                         equ 0004h
AD1CH1_CH31_POSN                         equ 0003h
AD1CH1_CH31_POSITION                     equ 0003h
AD1CH1_CH31_SIZE                         equ 0001h
AD1CH1_CH31_LENGTH                       equ 0001h
AD1CH1_CH31_MASK                         equ 0008h
AD1CH1_CH32_POSN                         equ 0004h
AD1CH1_CH32_POSITION                     equ 0004h
AD1CH1_CH32_SIZE                         equ 0001h
AD1CH1_CH32_LENGTH                       equ 0001h
AD1CH1_CH32_MASK                         equ 0010h
AD1CH1_CH33_POSN                         equ 0005h
AD1CH1_CH33_POSITION                     equ 0005h
AD1CH1_CH33_SIZE                         equ 0001h
AD1CH1_CH33_LENGTH                       equ 0001h
AD1CH1_CH33_MASK                         equ 0020h
AD1CH1_CH34_POSN                         equ 0006h
AD1CH1_CH34_POSITION                     equ 0006h
AD1CH1_CH34_SIZE                         equ 0001h
AD1CH1_CH34_LENGTH                       equ 0001h
AD1CH1_CH34_MASK                         equ 0040h
AD1CH1_CH35_POSN                         equ 0007h
AD1CH1_CH35_POSITION                     equ 0007h
AD1CH1_CH35_SIZE                         equ 0001h
AD1CH1_CH35_LENGTH                       equ 0001h
AD1CH1_CH35_MASK                         equ 0080h

// Register: AD2CON0
#define AD2CON0 AD2CON0
AD2CON0                                  equ 0791h
// bitfield definitions
AD2CON0_ADON_POSN                        equ 0000h
AD2CON0_ADON_POSITION                    equ 0000h
AD2CON0_ADON_SIZE                        equ 0001h
AD2CON0_ADON_LENGTH                      equ 0001h
AD2CON0_ADON_MASK                        equ 0001h
AD2CON0_GO_POSN                          equ 0001h
AD2CON0_GO_POSITION                      equ 0001h
AD2CON0_GO_SIZE                          equ 0001h
AD2CON0_GO_LENGTH                        equ 0001h
AD2CON0_GO_MASK                          equ 0002h
AD2CON0_CHS_POSN                         equ 0002h
AD2CON0_CHS_POSITION                     equ 0002h
AD2CON0_CHS_SIZE                         equ 0006h
AD2CON0_CHS_LENGTH                       equ 0006h
AD2CON0_CHS_MASK                         equ 00FCh
AD2CON0_AD2ON_POSN                       equ 0000h
AD2CON0_AD2ON_POSITION                   equ 0000h
AD2CON0_AD2ON_SIZE                       equ 0001h
AD2CON0_AD2ON_LENGTH                     equ 0001h
AD2CON0_AD2ON_MASK                       equ 0001h
AD2CON0_GO_nDONE_POSN                    equ 0001h
AD2CON0_GO_nDONE_POSITION                equ 0001h
AD2CON0_GO_nDONE_SIZE                    equ 0001h
AD2CON0_GO_nDONE_LENGTH                  equ 0001h
AD2CON0_GO_nDONE_MASK                    equ 0002h
AD2CON0_CHS0_POSN                        equ 0002h
AD2CON0_CHS0_POSITION                    equ 0002h
AD2CON0_CHS0_SIZE                        equ 0001h
AD2CON0_CHS0_LENGTH                      equ 0001h
AD2CON0_CHS0_MASK                        equ 0004h
AD2CON0_CHS1_POSN                        equ 0003h
AD2CON0_CHS1_POSITION                    equ 0003h
AD2CON0_CHS1_SIZE                        equ 0001h
AD2CON0_CHS1_LENGTH                      equ 0001h
AD2CON0_CHS1_MASK                        equ 0008h
AD2CON0_CHS2_POSN                        equ 0004h
AD2CON0_CHS2_POSITION                    equ 0004h
AD2CON0_CHS2_SIZE                        equ 0001h
AD2CON0_CHS2_LENGTH                      equ 0001h
AD2CON0_CHS2_MASK                        equ 0010h
AD2CON0_CHS3_POSN                        equ 0005h
AD2CON0_CHS3_POSITION                    equ 0005h
AD2CON0_CHS3_SIZE                        equ 0001h
AD2CON0_CHS3_LENGTH                      equ 0001h
AD2CON0_CHS3_MASK                        equ 0020h
AD2CON0_CHS4_POSN                        equ 0006h
AD2CON0_CHS4_POSITION                    equ 0006h
AD2CON0_CHS4_SIZE                        equ 0001h
AD2CON0_CHS4_LENGTH                      equ 0001h
AD2CON0_CHS4_MASK                        equ 0040h
AD2CON0_CHS5_POSN                        equ 0007h
AD2CON0_CHS5_POSITION                    equ 0007h
AD2CON0_CHS5_SIZE                        equ 0001h
AD2CON0_CHS5_LENGTH                      equ 0001h
AD2CON0_CHS5_MASK                        equ 0080h
AD2CON0_GO_nDONE2_POSN                   equ 0001h
AD2CON0_GO_nDONE2_POSITION               equ 0001h
AD2CON0_GO_nDONE2_SIZE                   equ 0001h
AD2CON0_GO_nDONE2_LENGTH                 equ 0001h
AD2CON0_GO_nDONE2_MASK                   equ 0002h

// Register: AD2CON2
#define AD2CON2 AD2CON2
AD2CON2                                  equ 0793h
// bitfield definitions
AD2CON2_TRIGSEL_POSN                     equ 0004h
AD2CON2_TRIGSEL_POSITION                 equ 0004h
AD2CON2_TRIGSEL_SIZE                     equ 0003h
AD2CON2_TRIGSEL_LENGTH                   equ 0003h
AD2CON2_TRIGSEL_MASK                     equ 0070h
AD2CON2_TRIGSEL0_POSN                    equ 0004h
AD2CON2_TRIGSEL0_POSITION                equ 0004h
AD2CON2_TRIGSEL0_SIZE                    equ 0001h
AD2CON2_TRIGSEL0_LENGTH                  equ 0001h
AD2CON2_TRIGSEL0_MASK                    equ 0010h
AD2CON2_TRIGSEL1_POSN                    equ 0005h
AD2CON2_TRIGSEL1_POSITION                equ 0005h
AD2CON2_TRIGSEL1_SIZE                    equ 0001h
AD2CON2_TRIGSEL1_LENGTH                  equ 0001h
AD2CON2_TRIGSEL1_MASK                    equ 0020h
AD2CON2_TRIGSEL2_POSN                    equ 0006h
AD2CON2_TRIGSEL2_POSITION                equ 0006h
AD2CON2_TRIGSEL2_SIZE                    equ 0001h
AD2CON2_TRIGSEL2_LENGTH                  equ 0001h
AD2CON2_TRIGSEL2_MASK                    equ 0040h

