GopalSaraf/Practicals/PSDL/include/proc/pic16lf1567.inc
// Register: AD2CH1
#define AD2CH1 AD2CH1
AD2CH1                                   equ 079Fh
// bitfield definitions
AD2CH1_CH28_POSN                         equ 0000h
AD2CH1_CH28_POSITION                     equ 0000h
AD2CH1_CH28_SIZE                         equ 0001h
AD2CH1_CH28_LENGTH                       equ 0001h
AD2CH1_CH28_MASK                         equ 0001h
AD2CH1_CH29_POSN                         equ 0001h
AD2CH1_CH29_POSITION                     equ 0001h
AD2CH1_CH29_SIZE                         equ 0001h
AD2CH1_CH29_LENGTH                       equ 0001h
AD2CH1_CH29_MASK                         equ 0002h
AD2CH1_CH40_POSN                         equ 0002h
AD2CH1_CH40_POSITION                     equ 0002h
AD2CH1_CH40_SIZE                         equ 0001h
AD2CH1_CH40_LENGTH                       equ 0001h
AD2CH1_CH40_MASK                         equ 0004h
AD2CH1_CH41_POSN                         equ 0003h
AD2CH1_CH41_POSITION                     equ 0003h
AD2CH1_CH41_SIZE                         equ 0001h
AD2CH1_CH41_LENGTH                       equ 0001h
AD2CH1_CH41_MASK                         equ 0008h
AD2CH1_CH42_POSN                         equ 0004h
AD2CH1_CH42_POSITION                     equ 0004h
AD2CH1_CH42_SIZE                         equ 0001h
AD2CH1_CH42_LENGTH                       equ 0001h
AD2CH1_CH42_MASK                         equ 0010h
AD2CH1_CH43_POSN                         equ 0005h
AD2CH1_CH43_POSITION                     equ 0005h
AD2CH1_CH43_SIZE                         equ 0001h
AD2CH1_CH43_LENGTH                       equ 0001h
AD2CH1_CH43_MASK                         equ 0020h
AD2CH1_CH44_POSN                         equ 0006h
AD2CH1_CH44_POSITION                     equ 0006h
AD2CH1_CH44_SIZE                         equ 0001h
AD2CH1_CH44_LENGTH                       equ 0001h
AD2CH1_CH44_MASK                         equ 0040h
AD2CH1_CH45_POSN                         equ 0007h
AD2CH1_CH45_POSITION                     equ 0007h
AD2CH1_CH45_SIZE                         equ 0001h
AD2CH1_CH45_LENGTH                       equ 0001h
AD2CH1_CH45_MASK                         equ 0080h

// Register: ICDIO
#define ICDIO ICDIO
ICDIO                                    equ 0F8Ch
// bitfield definitions
ICDIO_TRIS_ICDCLK_POSN                   equ 0002h
ICDIO_TRIS_ICDCLK_POSITION               equ 0002h
ICDIO_TRIS_ICDCLK_SIZE                   equ 0001h
ICDIO_TRIS_ICDCLK_LENGTH                 equ 0001h
ICDIO_TRIS_ICDCLK_MASK                   equ 0004h
ICDIO_TRIS_ICDDAT_POSN                   equ 0003h
ICDIO_TRIS_ICDDAT_POSITION               equ 0003h
ICDIO_TRIS_ICDDAT_SIZE                   equ 0001h
ICDIO_TRIS_ICDDAT_LENGTH                 equ 0001h
ICDIO_TRIS_ICDDAT_MASK                   equ 0008h
ICDIO_LAT_ICDCLK_POSN                    equ 0004h
ICDIO_LAT_ICDCLK_POSITION                equ 0004h
ICDIO_LAT_ICDCLK_SIZE                    equ 0001h
ICDIO_LAT_ICDCLK_LENGTH                  equ 0001h
ICDIO_LAT_ICDCLK_MASK                    equ 0010h
ICDIO_LAT_ICDDAT_POSN                    equ 0005h
ICDIO_LAT_ICDDAT_POSITION                equ 0005h
ICDIO_LAT_ICDDAT_SIZE                    equ 0001h
ICDIO_LAT_ICDDAT_LENGTH                  equ 0001h
ICDIO_LAT_ICDDAT_MASK                    equ 0020h
ICDIO_PORT_ICDCLK_POSN                   equ 0006h
ICDIO_PORT_ICDCLK_POSITION               equ 0006h
ICDIO_PORT_ICDCLK_SIZE                   equ 0001h
ICDIO_PORT_ICDCLK_LENGTH                 equ 0001h
ICDIO_PORT_ICDCLK_MASK                   equ 0040h
ICDIO_PORT_ICDDAT_POSN                   equ 0007h
ICDIO_PORT_ICDDAT_POSITION               equ 0007h
ICDIO_PORT_ICDDAT_SIZE                   equ 0001h
ICDIO_PORT_ICDDAT_LENGTH                 equ 0001h
ICDIO_PORT_ICDDAT_MASK                   equ 0080h

// Register: ICDCON0
#define ICDCON0 ICDCON0
ICDCON0                                  equ 0F8Dh
// bitfield definitions
ICDCON0_RSTVEC_POSN                      equ 0000h
ICDCON0_RSTVEC_POSITION                  equ 0000h
ICDCON0_RSTVEC_SIZE                      equ 0001h
ICDCON0_RSTVEC_LENGTH                    equ 0001h
ICDCON0_RSTVEC_MASK                      equ 0001h
ICDCON0_DBGINEX_POSN                     equ 0003h
ICDCON0_DBGINEX_POSITION                 equ 0003h
ICDCON0_DBGINEX_SIZE                     equ 0001h
ICDCON0_DBGINEX_LENGTH                   equ 0001h
ICDCON0_DBGINEX_MASK                     equ 0008h
ICDCON0_SSTEP_POSN                       equ 0005h
ICDCON0_SSTEP_POSITION                   equ 0005h
ICDCON0_SSTEP_SIZE                       equ 0001h
ICDCON0_SSTEP_LENGTH                     equ 0001h
ICDCON0_SSTEP_MASK                       equ 0020h
ICDCON0_FREEZ_POSN                       equ 0006h
ICDCON0_FREEZ_POSITION                   equ 0006h
ICDCON0_FREEZ_SIZE                       equ 0001h
ICDCON0_FREEZ_LENGTH                     equ 0001h
ICDCON0_FREEZ_MASK                       equ 0040h
ICDCON0_INBUG_POSN                       equ 0007h
ICDCON0_INBUG_POSITION                   equ 0007h
ICDCON0_INBUG_SIZE                       equ 0001h
ICDCON0_INBUG_LENGTH                     equ 0001h
ICDCON0_INBUG_MASK                       equ 0080h

// Register: ICDSTAT
#define ICDSTAT ICDSTAT
ICDSTAT                                  equ 0F91h
// bitfield definitions
ICDSTAT_USRHLTF_POSN                     equ 0001h
ICDSTAT_USRHLTF_POSITION                 equ 0001h
ICDSTAT_USRHLTF_SIZE                     equ 0001h
ICDSTAT_USRHLTF_LENGTH                   equ 0001h
ICDSTAT_USRHLTF_MASK                     equ 0002h
ICDSTAT_TRP0HLTF_POSN                    equ 0006h
ICDSTAT_TRP0HLTF_POSITION                equ 0006h
ICDSTAT_TRP0HLTF_SIZE                    equ 0001h
ICDSTAT_TRP0HLTF_LENGTH                  equ 0001h
ICDSTAT_TRP0HLTF_MASK                    equ 0040h
ICDSTAT_TRP1HLTF_POSN                    equ 0007h
ICDSTAT_TRP1HLTF_POSITION                equ 0007h
ICDSTAT_TRP1HLTF_SIZE                    equ 0001h
ICDSTAT_TRP1HLTF_LENGTH                  equ 0001h
ICDSTAT_TRP1HLTF_MASK                    equ 0080h

